#+TITLE: Plan for Lab Data Service Dashboard
#+AUTHOR: VLEAD
#+DATE: [2017-06-19 Mon]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export

* Introduction
  This document contains the realization plan for
  implementing the Lab Data Service.  This application is
  realized as series of [[https://github.com/vlead/lab-data-service-dashboard/milestones?state=closed][milestones]]. 

* Milestones Snapshot
  |---+------+----+-----+---------------------------------------------------+------+--------+-----+-----+--------|
  |   | S.no | Mi | Req | Milestone                                         | Plan | Status | Est | Act | Issues |
  |   |      | no | Map |                                                   |      |        | hrs | hrs |        |
  |---+------+----+-----+---------------------------------------------------+------+--------+-----+-----+--------|
  |   |    1 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/1][1]]  |     | [[https://github.com/vlead/lab-data-service-dashboard/milestone/1][login/logout pages with default admin/guest roles]] | [[Loin and Logout pages with default admin and guest roles][ref]]  | Closed | 233 | 191 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/1?closed=1][ref]]    |
  |---+------+----+-----+---------------------------------------------------+------+--------+-----+-----+--------|
  |   |    2 | [[https://github.com/vlead/lab-data-service/milestone/2][2]]  |     | [[https://github.com/vlead/lab-data-service-dashboard/milestone/2][Implementation of Front end as SPA]]                | [[Implementaion of Front end as Single Page Application(SPA)][ref]]  | Closed | 152 | 123 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/2?closed=1][ref]]    |
  |---+------+----+-----+---------------------------------------------------+------+--------+-----+-----+--------|
  |   |    3 | [[https://github.com/vlead/lab-data-service/milestone/3][3]]  |     | [[https://github.com/vlead/lab-data-service-dashboard/milestone/3][Implementation of Front end Dashboard for LDS]]     | [[Implementation of Front end Dashboard for LDS][ref]]  | Closed |   0 |   0 | [[https://github.com/vlead/lab-data-service-dashboard/milestone/3?closed=1][ref]]    |
  |---+------+----+-----+---------------------------------------------------+------+--------+-----+-----+--------|
  |   |      |    |     | Total                                             |      |        |     |     |        |
  | ^ |      |    |     |                                                   |      |        |  et |  at |        |
  |---+------+----+-----+---------------------------------------------------+------+--------+-----+-----+--------|
  #+TBLFM: $2=@#-2
  #+TBLFM: @3$8=remote(tbl-rlz-pln-ml-1, $estimated)
  #+TBLFM: @3$9=remote(tbl-rlz-pln-ml-1, $actual)
  #+TBLFM: @4$8=remote(tbl-rlz-pln-ml-2, $estimated)
  #+TBLFM: @4$9=remote(tbl-rlz-pln-ml-2, $actual)
  #+TBLFM: @5$8=remote(tbl-rlz-pln-ml-3, $estimated)
  #+TBLFM: @5$9=remote(tbl-rlz-pln-ml-3, $actual)
  #+TBLFM: $et=vsum(@II+1..@-1)
  #+TBLFM: $at=vsum(@II+1..@-1)

* Detailed Plans

** Loin and Logout pages with default admin and guest roles
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone1
  :END: 
  This [[https://github.com/vlead/lab-data-service-dashboard/milestone/1][milestone]] captures the requirements, design and implementation
for login and logout pages with implementation and deployment.

#+caption: realization-plan-ml-1
#+name: tbl-rlz-pln-ml-1
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   | S.NO | Tasks                   | Github |  Expected | Actual | Status | Assignee |
|   |      |                         | Issues |    Effort | Effort |        |          |
|   |      |                         |        |       (in |    (in |        |          |
|   |      |                         |        |    person | person |        |          |
|   |      |                         |        |    hours) | hours) |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   1. | Requirements            | [[https://github.com/vlead/lab-data-service-dashboard/issues/1][#1]]     |         2 |      1 | Done   | Madhavi  |
|   |      | Gathering               |        |           |        |        | Puliraju |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   2. | Implement Log in        | [[https://github.com/vlead/lab-data-service-dashboard/issues/2][#2]]     |           |        | Done   | Utkarsh  |
|   |      | and logout feature      |        |        40 |     40 |        |          |
|   |      | with Google             |        |           |        |        |          |
|   |      | authentication          |        |           |        |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   3. | Implement API's         | [[https://github.com/vlead/lab-data-service-dashboard/issues/3][#3]],    |        45 |     45 | Done   | Yahnit   |
|   |      | for log in and log out, |        |           |        |        |          |
|   |      | users and roles         |        |           |        |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   4. | Implement the           | [[https://github.com/vlead/lab-data-service-dashboard/issues/4][#4]]     |           |        | Done   | Yahnit,  |
|   |      | unit test cases         |        |        12 |     13 |        | Utkarsh  |
|   |      | for log in, log out,    |        |           |        |        |          |
|   |      | users and roles         |        |           |        |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   5. | Integration of          | [[https://github.com/vlead/lab-data-service-dashboard/issues/5][#5]]     |           |        | Done   | Utkarsh  |
|   |      | google authentication   |        |        14 |     14 |        |          |
|   |      | with log in and logout  |        |           |        |        |          |
|   |      | API's                   |        |           |        |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   6. | Data Model for Lab      | [[https://github.com/vlead/lab-data-service-dashboard/issues/6][#6]]     |        32 |     24 | Done   | Madhavi  |
|   |      | Data Service Dashboard  |        |           |        |        | Puliraju |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   7. | Documention to run      | [[https://github.com/vlead/lab-data-service-dashboard/issues/7][#7]]     |        32 |     12 | Done   | Madhavi  |
|   |      | the lds dashboard in    |        |           |        |        | Puliraju |
|   |      | development environment |        |           |        |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   8. | Auto Deployment         | [[https://github.com/vlead/lab-data-service-dashboard/issues/11][#11]]    |        32 |     32 | Done   | Madhavi  |
|   |      | of LDS Dashboard        |        |           |        |        | Puliraju |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |   9. | first level Model       | [[https://github.com/vlead/lab-data-service-dashboard/issues/12][#12]]    |        12 |      6 | Done   | Madhavi  |
|   |      | Review for milestone1   |        |           |        |        | Puliraju |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |  10. | First Review            | [[https://github.com/vlead/lab-data-service-dashboard/issues/13][#13]]    |        12 |      4 | Done   | Madhavi  |
|   |      | Comments [09-06-2017]   |        |           |        |        | Puliraju |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
|   |      | Total                   |        |       233 |    191 |        |          |
| ^ |      |                         |        | estimated | actual |        |          |
|---+------+-------------------------+--------+-----------+--------+--------+----------|
 #+TBLFM: $estimated=vsum(@II+1..@-1)
 #+TBLFM: $actual=vsum(@II+1..@-1)


  *Note* : Expected and Actual Efforts are calculated in person hours. 


** Implementaion of Front end as Single Page Application(SPA)
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone2
  :END: 
  This [[https://github.com/vlead/lab-data-service/milestone/2][milestone]] captures the implementation of Front End with Login,
  Logout, Admin and Guest Dashboards as Single Page Applications
  (SPA). This Implementation does not use any
  framework. Implementation will be done using pure java script.

#+caption:  realization-plan-ml-2
#+name: tbl-rlz-pln-ml-2
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   | S.NO | Tasks                  | Github |  Expected | Actual | Status | Assignee |
|   |      |                        | Issues |    Effort | Effort |        |          |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |   1. | Implementation         | [[https://github.com/vlead/lab-data-service-dashboard/issues/9][#9]]     |        40 |     45 | Done   | Yahnit,  |
|   |      | of Admin Dashboard     |        |           |        |        | Utkarsh  |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |   2. | Implementation         | [[https://github.com/vlead/lab-data-service-dashboard/issues/10][#10]]    |        40 |     10 | Done   | Yahnit,  |
|   |      | of 'Guest' Dashboard   |        |           |        |        | Utkarsh  |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |   3. | Re-Implementation      | [[https://github.com/vlead/lab-data-service-dashboard/issues/14][#14]]    |         4 |      2 | Done   | Utkarsh  |
|   |      | of Log in and Log out  |        |           |        |        |          |
|   |      | using Single Page      |        |           |        |        |          |
|   |      | Application (SPA)      |        |           |        |        |          |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |   4. | Read Json elements     | [[https://github.com/vlead/lab-data-service-dashboard/issues/15][#15]]    |         6 |      6 | Done   | Yahnit   |
|   |      | and generate html code |        |           |        |        |          |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |   5. | Implement Event        | [[https://github.com/vlead/lab-data-service-dashboard/issues/16][#16]]    |        38 |     44 | Done   | Yahnit,  |
|   |      | handlers for all       |        |           |        |        | Utkarsh  |
|   |      | CRUD operations        |        |           |        |        |          |
|   |      | in front end           |        |           |        |        |          |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |   6. | Auto Deployment of     | [[https://github.com/vlead/lab-data-service-dashboard/issues/19][#19]]    |        24 |     16 | Done   | Madhavi  |
|   |      | LDS Dashboard using    |        |           |        |        | Puliraju |
|   |      | ubuntu 14.04 template  |        |           |        |        |          |
|---+------+------------------------+--------+-----------+--------+--------+----------|
|   |      | Total                  |        |       152 |    123 |        |          |
| ^ |      |                        |        | estimated | actual |        |          |
|---+------+------------------------+--------+-----------+--------+--------+----------|
 #+TBLFM: $estimated=vsum(@II+1..@-1)
 #+TBLFM: $actual=vsum(@II+1..@-1)


  *Note*: Expected and Actual Efforts are calculated in person hours. 
  
  
** Implementation of Front end Dashboard for LDS
  :PROPERTIES:
  :CUSTOM_ID: plan-for-milestone3
  :END: 
  This [[https://github.com/vlead/lab-data-service/milestone/3][milestone]] captures the implementation of of Front End Dashboard
for LDS as Single Page Application (SPA). This Implementation does not
use any framework. Implementation will be done using pure
javascript. With the help of LDS Dashboard one will be able to do all
the CRUD operations on Labs info based on the given role and a user.
#+caption:  realization-plan-ml-3
#+name: tbl-rlz-pln-ml-3
|---+------+----------------------+--------+-----------+--------+-------------+----------|
|   | S.NO | Tasks                | Github | Expected  | Actual | Status      | Assignee |
|   |      |                      | Issues | Effort    | Effort |             |          |
|---+------+----------------------+--------+-----------+--------+-------------+----------|
|   | 1.   | Creation of JSON     | [[https://github.com/vlead/lab-data-service-dashboard/issues/18][#18]]    |           |        | In Progress | Madhavi  |
|   |      | specifications to    |        |           |        |             | Puliraju |
|   |      | define the HTML      |        |           |        |             |          |
|   |      | Structure for        |        |           |        |             |          |
|   |      | generation of all    |        |           |        |             |          |
|   |      | the entities defined |        |           |        |             |          |
|   |      | in LDS               |        |           |        |             |          |
|---+------+----------------------+--------+-----------+--------+-------------+----------|
|   |      |                      |        | 0         | 0      |             |          |
| ^ |      | Total                |        | estimated | actual |             |          |
|---+------+----------------------+--------+-----------+--------+-------------+----------|
 #+TBLFM: $estimated=vsum(@II+1..@-1)
 #+TBLFM: $actual=vsum(@II+1..@-1)

  *Note*: Expected and Actual Efforts are calculated in person hours. 

  
** Realization
  Implementing the above plan will result into the following -
   + Admin will be able to do all =CRUD= operations on labs data through Admin
     portal in LDS dashboard.
   + Admin Role should be able to perform all the =CRUD= operations through LDS
     dashboard. 
   + Admin Role should be able to add other users and assign roles to them in
     Admin portal in LDS dashboard.
   + Guest Role should be able to =Read/View= the labs data through guest
     portal in LDS dashboard.
   + Authentication and Authorization should be provided for all the LDS
     Dashboard users. 
   + LDS Dashboard will be able to Generate HTML code from the given JSON
     specification. 


 
  
